Repository: contao-estatemanager/onoffice-api-import
Catalog: src/Resources/contao/languages/*/onoffice_import.xlf
Languages: de

# onoffice_import.title
source: Import data from onOffice
de: Daten aus onOffice importieren

# onoffice_import.message
source: Some functions are not available because the corresponding extensions are not installed.
de: Einige Funktionen stehen nicht zur Verfügung, da die entsprechenden Erweiterungen nicht installiert sind.

# onoffice_import.regions.title
source: Regions
de: Regionen

# onoffice_import.regions.desc
source: Imports regions based on the selected language (ISO-639; e.g. DEU, ENG) from onOffice.
de: Importiert Regionen anhand der gewählten Sprache (ISO-639; Bspw. DEU, ENG) aus onOffice.

# onoffice_import.objectTypes.title
source: Object types
de: Objekttypen

# onoffice_import.objectTypes.desc
source: Imports object types based on the selected language (ISO-639; e.g. DEU, ENG) from onOffice.
de: Importiert Objekttypen anhand der gewählten Sprache (ISO-639; Bspw. DEU, ENG) aus onOffice.

# onoffice_import.searchCriteria.title
source: Search inquiries
de: Suchanfragen

# onoffice_import.searchCriteria.desc
source: Imports search inquiries from onOffice
de: Importiert alle Suchanfragen anhand einer bestimmten Vermarktungsart aus onOffice.

# onoffice_import.settings.truncate.0
source: Truncate table
de: Tabelle leeren

# onoffice_import.settings.truncate.1
source: Delete all existing records before importing
de: Alle vorhandenen Datensätze vor dem Importieren löschen

# onoffice_import.settings.language.0
source: Language
de: Sprache

# onoffice_import.settings.language.1
source: Please enter the preferred language here
de: Geben Sie hier bitte die bevorzugte Sprache an

# onoffice_import.settings.marketingType.0
source: Marketing type
de: Vermakrtungsart

# onoffice_import.settings.marketingType.1
source: Please enter the preferred marketing type here
de: Geben Sie hier bitte die bevorzugte Vermarktungsart an

# onoffice_import.settings.marketingType.buy
source: Buy
de: Kauf

# onoffice_import.settings.marketingType.rent
source: Rent
de: Miete

# onoffice_import.settings.import_regions.0
source: Connect region (low performance)
de: Regionen verbinden (nicht empfohlen)

# onoffice_import.settings.import_regions.1
source: Connects the search request with available regions in the system. Works only with regions imported from onOffice. Instead of a fixed assignment of regions, it is recommended to use the proximity search.
de: Verbindet den Suchauftrag mit verfügbaren Regionen im System. Funktioniert nur mit Regionen, welche aus onOffice importiert wurden. Statt einer festen Zuweisung der Regionen, wird empfohlen die Umkreissuche zu verwenden.

# onoffice_import.sections.cronCreateSearchCriteria.0
source: Import search criteria
de: Suchanfragen importieren

# onoffice_import.sections.cronCreateSearchCriteria.1
source: Set up this cronjob to regularly synchronize new searches with the system.
de: Richten Sie diesen Cronjob ein, um regelmäßig neue Suchanfragen mit dem System zu synchronisieren.

# onoffice_import.sections.cronUpdateSearchCriteria.0
source: Update / Delete search criteria
de: Suchanfragen aktualisieren / löschen

# onoffice_import.sections.cronUpdateSearchCriteria.1
source: Set up this cronjob to regularly update the search queries that exist in the system. If a record no longer exists in onOffice, it will be deleted.
de: Richten Sie diesen Cronjob ein, um regelmäßig die im System vorhanden Suchanfragen zu aktualisieren. Sofern ein Datensatz nicht mehr in onOffice existiert, wird dieser gelöscht.

# onoffice_import.button_settings
source: Settings
de: Einstellungen

# onoffice_import.button_import
source: Import
de: Importieren

# onoffice_import.confirm_import
source: Do you really want to start the import? This process may take a few minutes.
de: Möchtest du den Import wirklich starten? Dieser Vorgang kann einige Minuten in Anspruch nehmen.
